[
  {
    "testimonial": "I cannot speak highly enough of our strength and conditioning coach, Zach. His deep knowledge of what it takes to be a high-performance athlete comes from both his extensive experience and his background as an athlete himself. Zach understands the nuances of training and was continuously developing innovative ways to help us progress. What I appreciated most about Zach was how he tailored the training to be specifically applicable to rowing. Every session was thoughtfully designed to enhance not only raw strength, but functional power and endurance, which translated directly to our performance on the water. Zach truly puts athletes first. He takes the time to understand your individual needs and goals, always looking out for your best interests, whether that means adjusting the workload or offering advice on recovery. He fosters an environment where communication is always open, and he genuinely listens. Above all, Zach made training fun. His positive attitude and engaging approach made each lifting session something I looked forward to. He's not only a great coach but also an amazing person to be around. I've learned so much from him and I'm incredibly grateful for his guidance throughout my Olympic journey.",
    "name": "Jess Sevick",
    "position": "Canadian Olympic Rower",
    "organization": "2024 Silver Medalist",
    "image": "/images/testimonial_headshots/Jessica.png"
  },
  {
    "testimonial": "At the end of my 20-year rowing career, which included three Olympic Games and a silver medal, I had the privilege of working with Zach Kalthoff. His expertise in strength and conditioning not only helped me to be competitive in the final stretch of my journey, but also reignited my passion for training. Zach's attention to detail, understanding of high-performance sport, and ability to adapt programs to meet my specific needs made a huge difference and allowed me to make solid strength gains late in my rowing career. I'm incredibly grateful for his support and guidance during that crucial time.",
    "name": "Will Crothers",
    "position": "3x Olympian",
    "organization": "Olympic Silver Medalist",
    "image": "/images/testimonial_headshots/Will C.png"
  },
  {
    "testimonial": "Zach is a rare talent in the world of strength and conditioning. Working with a cardio-focused, high-endurance sport like rowing, he mastered the challenge of building strength and muscle while preventing injury in athletes who spend years performing repetitive motion. His ability to create individualized programs for athletes of different genders, boat classes, and weight categories ensured that every person saw measurable improvements tailored to their unique needs. What sets Zach apart is his holistic approach. He emphasizes proper technique over shortcuts, helping athletes build strength safely and sustainably. His expertise in injury prevention and rehabilitation was critical in my return to sport after two hip surgeries, and his programs laid the foundation for long-term health and performance. Whether you're an athlete transitioning to life after sport or someone looking to stay strong and injury-free, Zach has the knowledge and experience to help you achieve your goals with confidence.",
    "name": "Jenny Casson",
    "position": "Canadian Olympic Rower",
    "organization": "2x Olympian",
    "image": "/images/testimonial_headshots/Jenny.png"
  },
  {
    "testimonial": "I owe a significant portion of my athletic growth to my former strength coach, Zach. Under his guidance, I experienced substantial improvements in strength, speed, and explosiveness. What truly set him apart, however, was his dedication to my overall development; he went above and beyond by meeting with me one-on-one to review my diet and overall progress, ensuring I had the tools to succeed. I can confidently say that if you are willing to put in the work, Zach can help you achieve your goals.",
    "name": "Jordan Perreira",
    "position": "Former Volleyball Canada National Team Athlete",
    "organization": "",
    "image": "/images/testimonial_headshots/Jordan P.png"
  },
  {
    "testimonial": "As a high-performance athlete, we're always striving for that extra 1%. For me, it was improving my strength, and it wasn't until I started working with Zach that I realized I could improve by 5-10%. Zach helped take me from a national team rower to an Olympic silver medalist. He's not only incredibly knowledgeable in strength and conditioning, but also highly adaptable. Always prioritizing the athlete, he creates tailored programs to ensure we reach our peak performance. I can't recommend anyone more highly than Zach.",
    "name": "Kristina Walker",
    "position": "Canadian Olympic Rower",
    "organization": "2024 Silver Medalist",
    "image": "/images/testimonial_headshots/Kris W.png"
  },
  {
    "testimonial": "After I had my first session with Zach back in December of 2015 I knew that I was in for a very difficult offseason but that it would be well worth it. I was 2 and a half years removed from a dislocated knee which required surgery in which I had my PCL, LCL, lateral meniscus and hamstring tendon repaired. Even though I had been back on field for two years and was fresh off a season in which I started every game I still had some mental and physical limitations when it came to my knee. To add to that, I had been suffering from a left shoulder impingement that was causing me to have stingers and resulted in me losing a lot of strength. Zach's approach was far different from other people that I had worked with. He took time to identify what my limitations were and we attacked them from the start. Instead of being worried about strength numbers and doing traditional 'football player lifting' he focused on quality of movement and doing things pain free. For my knee we focused on single leg strength and balance which helped me get over most of the mental hurdles that I had. I went from not feeling comfortable doing anything dynamic without wearing a knee brace to being able to do plyometric and agility drills without my brace in only a few months. The shoulder rehab might have been more remarkable given how much change was made in the short period of time we had together. In December my left arm had about 50% of the strength that my right arm did and almost any pressing movement caused pain. By April I was able to do everything again and was back to full strength. Now my training with Zach doesn't involve as much rehab as it did before but we still focus on functional movement, stability and training pain free. Going into my 6th year of professional football Zach finds a lot of different exercises to challenge me but also minimize risk of injury and prevent injuries in the future. I can honestly say that I haven't trained with someone who puts as much into his athletes as Zach and would recommend athletes of all ages and skill levels to train with Zach.",
    "name": "Kirby Fabien",
    "position": "Former Veteran Offensive Linemen",
    "organization": "Montreal Alouettes – CFL Football",
    "image": "/images/testimonial_headshots/Kirby.png"
  },
  {
    "testimonial": "Working with Zach Kalthoff as my trainer has been an absolute privilege. Zach is not only a knowledgeable strength and conditioning coach, he is respectful towards his athletes and cares to see them reach their maximal potential. As an experienced high-performance athlete, Zach understands that we wanted to work together on a program that addresses the nuances of the human body while always giving a holistic perspective to excellence. I would highly recommend Zach to anyone looking for performance or injury prevention support.",
    "name": "Kasia Gruchalla-Wesierski",
    "position": "Canadian Olympic Rower",
    "organization": "2x Olympic Medalist",
    "image": "/images/testimonial_headshots/Kasia.png"
  },
  {
    "testimonial": "The first thing Zach told me was that in order to achieve what I want, I must fully trust him. Then he wanted to know about me as a person, then my sport. To me that was so new because I've been fortunate enough to work with reputable trainers for prominent sport franchises across North America and I never had that type of introduction prior to working with a trainer. [...] He is such a positive human being that you have no choice but to join him and become positive yourself.",
    "name": "Junior Turner",
    "position": "Former Veteran Defensive Linemen",
    "organization": "Calgary Stampeders",
    "image": "/images/testimonial_headshots/Junior.png"
  },
  {
    "testimonial": "Coming off of hip surgery December 23rd 2015 I never thought I would be ready for training camp that started mid-May. But somehow the power may be that Zach had me not only ready to go but in the best shape of my career. [...] Zach is extremely dedicated to his athletes' success, he programs specifically to each individual athlete's needs, and is highly invested in all his athletes no matter the level, experience or age. If anyone ever asked me where they should train or who they should train with, Zach is the only name I would put forward.",
    "name": "Mike Klassen",
    "position": "Former Veteran Defensive Linemen",
    "organization": "Ottawa Redblacks – CFL Football",
    "image": "/images/testimonial_headshots/Mike Klassen.png"
  },
  {
    "testimonial": "I have personally had the pleasure of knowing Zach Kalthoff for the last five years, which turned out to be my most successful years both on and off the ice. [...] He is the first person I would recommend as a trainer and know that he is the best option for any athlete looking to gain an edge up on the competition in their respected sport.",
    "name": "Mike Barabash",
    "position": "Former Calgary Mustangs Junior Hockey Player",
    "organization": "",
    "image": "/images/testimonial_headshots/Mike B.png"
  },
  {
    "testimonial": "Working with Zach this past summer was by far the most productive summer of training I've had for sure. His understanding of not only strength training but also mobility and nutrition helped me marvellously in achieving my offseason goals. Myself being a hockey player it was a nice change being able to have Zach and his hockey specific mobility and strength regimen to help me take a very positive step towards bettering myself on and off the ice. Zach is a very positive and professional trainer and knows exactly how to get the most out of his athletes that are lucky enough to work with him. I appreciate everything that he's done for me and have nothing but positive to take from working with him.",
    "name": "Brycen Martin",
    "position": "2014 NHL Draft Pick",
    "organization": "Current ECHL Player",
    "image": "/images/testimonial_headshots/Brycen.jpg"
  },
  {
    "testimonial": "I have trained with Zach for the past 4 years and he is one of the most knowledgeable trainers I have ever had. He has been instrumental in me becoming the athlete I am today. After having off season hip surgery, Zach was a huge part of my rehab. He worked closely with my physiotherapist to ensure I had the best team to help me recover back to 100%. Zach understands when to push yourself after an injury and how far to safely push it. His knowledge for athletics is unparalleled. His attention to detail is second to none, focusing on areas that are crucial to not only your sport, but your position in the sport. If you disagree with something Zach says, he's more than willing to discuss why he tells you to do what he does, showing that there is a reason for everything he teaches. Zach helped me develop a diet plan to help me reach my weight and strength goal. Zach is always there to go above and beyond and is a huge reason I am the athlete I am today.",
    "name": "Nick Sanders",
    "position": "Former WHL Goaltender",
    "organization": "Calgary Hitmen",
    "image": "/images/testimonial_headshots/Nick Saners.png"
  },
  {
    "testimonial": "Working with Zach has been a game-changer for me—not just in the weight room but on the water as well. His incredible attention to detail and ability to break down movement patterns helped me make huge technical changes that directly improved my rowing performance and mitigated injuries. Every session was tailored not just to getting stronger, but to moving better, with a focus on efficiency and precision that translated seamlessly into my stroke. His knowledge, dedication, and coaching style made a massive impact on my training, and I'm so grateful for his role in my development as an athlete. On top of that, his contagious positive energy and enthusiasm for training make every session something to look forward to.",
    "name": "Sydney Payne",
    "position": "Canadian Olympic Rower",
    "organization": "2x Olympic Medalist",
    "image": "/images/testimonial_headshots/Sydney P.png"
  }
]